#### Parameter Property (Definition)

---

|  |
| --- |
| FamilyManager Class   See Also |

Obtains the parameter of this type with a given definition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyParameter this[ 	Definition definition ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Parameter ( _ 	definition As Definition _ ) As FamilyParameter 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property FamilyParameter^ Parameter[Definition^ definition] { 	FamilyParameter^ get (Definition^ definition); } ``` |

#### Parameters

definition
:   Type:  Autodesk.Revit.DB Definition

# Remarks

Returns    a null reference (  Nothing  in Visual Basic)  if the parameter is not found.

# See Also

FamilyManager Class

Parameter Overload

Autodesk.Revit.DB Namespace